run/acousticTests/Andrade2019/wedgeHexTwoWayCoupWindow/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
zVelocity 0.01;

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

// NOTE: the boundary conditions differ from those given in Popinet2009.
// In that publication, symmetry and periodic boundary conditions
// are used.
boundaryField
{
    openAir
    {
        type            pressureInletOutletVelocity;
        // inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    "(transducer.*|reflector.*)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

     "(front|back)"
     { 
         type            wedge;
     }

}


// ************************************************************************* //
