run/acousticTests/Andrade2019/wedgeHexTwoWayCoupWindow/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

// Defining the properties as variables first allows it to
// express a property of one phase in terms of the other
// through the parameter file
nu_droplet  0.0;
nu_ambient  0.0;
rho_droplet 1000.0;
rho_ambient 1.2;

water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] $nu_droplet;
    rho             rho [ 1 -3 0 0 0 0 0 ] $rho_droplet;
}

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] $nu_ambient;
    rho             rho [ 1 -3 0 0 0 0 0 ] $rho_ambient;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.072;

surfaceForces
{
  sigma 0.072;
  surfaceTensionForceModel RDF;//gradAlpha;
  accelerationForceModel gravity;
  deltaFunctionModel alphaCSF;
}

soundSpeed  343;
// physical properties at 20°C

cg $soundSpeed;
cl 1480; 
kg #eval{1.0/($rho_ambient*$cg*$cg)};
kl #eval{1.0/($rho_droplet*$cl*$cl)};
// ************************************************************************* //
