run/acousticTests/Andrade2019/wedgeHexTwoWayCoupWindow/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// This delta corresponds to a narrowband width of 4 cells
// to ensure the part of the domain in which the interface acts
// is uniformly resolved

actions
(
    {
        name    wallFace;
        type    faceSet;
        action  subset;
        source  boundaryToFace;
        sourceInfo
        {
           ""
        }
    }

/*    {
        name    interfaceRegion;
        type    cellSet;
        action  new;
        source  pointToCell;
        sourceInfo
        {
            set     interfaceRegionCellCorners;
            option  any;
        }
    }*/
);

// ************************************************************************* //

